In [34]:
import pandas as pd
import numpy as np

In [41]:
df = pd.read_csv("Resale-flat-prices-2017.csv")
print(df)

          month        town         flat_type block        street_name  \
0       2017-01  ANG MO KIO            2 ROOM   406  ANG MO KIO AVE 10
1       2017-01  ANG MO KIO            3 ROOM   108   ANG MO KIO AVE 4
2       2017-01  ANG MO KIO            3 ROOM   602   ANG MO KIO AVE 5
3       2017-01  ANG MO KIO            3 ROOM   465  ANG MO KIO AVE 10
4       2017-01  ANG MO KIO            3 ROOM   601   ANG MO KIO AVE 5
...         ...         ...               ...   ...                ...
213878  2025-04      YISHUN         EXECUTIVE   828       YISHUN ST 81
213879  2025-05      YISHUN         EXECUTIVE   828       YISHUN ST 81
213880  2025-07      YISHUN         EXECUTIVE   824       YISHUN ST 81
213881  2025-05      YISHUN  MULTI-GENERATION   632       YISHUN ST 61
213882  2025-07      YISHUN  MULTI-GENERATION   633       YISHUN ST 61

       storey_range  floor_area_sqm        flat_model  lease_commence_date  \
0          10 TO 12            44.0          Improved                 1979
1          01 TO 03            67.0    New Generation                 1978
2          01 TO 03            67.0    New Generation                 1980
3          04 TO 06            68.0    New Generation                 1980
4          01 TO 03            67.0    New Generation                 1980
...             ...             ...               ...                  ...
213878     04 TO 06           146.0        Maisonette                 1988
213879     04 TO 06           142.0         Apartment                 1988
213880     04 TO 06           146.0        Maisonette                 1987
213881     04 TO 06           147.0  Multi Generation                 1987
213882     01 TO 03           171.0  Multi Generation                 1987

           remaining_lease  resale_price
0       61 years 04 months      232000.0
1       60 years 07 months      250000.0
2       62 years 05 months      262000.0
3        62 years 01 month      265000.0
4       62 years 05 months      265000.0
...                    ...           ...
213878  61 years 09 months      975000.0
213879  61 years 09 months     1000000.0
213880  61 years 05 months      980000.0
213881  61 years 06 months      945000.0
213882  61 years 06 months     1095000.0

[213883 rows x 11 columns]

In [36]:
print(df.columns)
print(df.dtypes)
df.describe(include="all")

Index(['month', 'town', 'flat_type', 'block', 'street_name', 'storey_range',
       'floor_area_sqm', 'flat_model', 'lease_commence_date',
       'remaining_lease', 'resale_price'],
      dtype='object')
month                   object
town                    object
flat_type               object
block                   object
street_name             object
storey_range            object
floor_area_sqm         float64
flat_model              object
lease_commence_date      int64
remaining_lease         object
resale_price           float64
dtype: object

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
count,213883,213883,213883,213883,213883,213883,213883.000000,213883,213883.000000,213883,2.138830e+05
unique,104,26,7,2743,576,17,NaN,21,NaN,691,NaN
top,2024-07,SENGKANG,4 ROOM,2,YISHUN RING RD,04 TO 06,NaN,Model A,NaN,94 years 10 months,NaN
freq,3036,17563,90535,643,3060,49096,NaN,76126,NaN,1880,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,96.834413,NaN,1996.374555,NaN,5.193248e+05
std,NaN,NaN,NaN,NaN,NaN,NaN,24.029862,NaN,14.257568,NaN,1.836412e+05
min,NaN,NaN,NaN,NaN,NaN,NaN,31.000000,NaN,1966.000000,NaN,1.400000e+05
25%,NaN,NaN,NaN,NaN,NaN,NaN,82.000000,NaN,1985.000000,NaN,3.820000e+05
50%,NaN,NaN,NaN,NaN,NaN,NaN,93.000000,NaN,1996.000000,NaN,4.880000e+05
75%,NaN,NaN,NaN,NaN,NaN,NaN,112.000000,NaN,2011.000000,NaN,6.228880e+05
max,NaN,NaN,NaN,NaN,NaN,NaN,366.700000,NaN,2022.000000,NaN,1.658888e+06

In [37]:
df.isnull().sum()

month                  0
town                   0
flat_type              0
block                  0
street_name            0
storey_range           0
floor_area_sqm         0
flat_model             0
lease_commence_date    0
remaining_lease        0
resale_price           0
dtype: int64

In [38]:
df.duplicated().sum()

np.int64(304)

In [42]:
df = df.drop_duplicates()
print(df)

          month        town         flat_type block        street_name  \
0       2017-01  ANG MO KIO            2 ROOM   406  ANG MO KIO AVE 10
1       2017-01  ANG MO KIO            3 ROOM   108   ANG MO KIO AVE 4
2       2017-01  ANG MO KIO            3 ROOM   602   ANG MO KIO AVE 5
3       2017-01  ANG MO KIO            3 ROOM   465  ANG MO KIO AVE 10
4       2017-01  ANG MO KIO            3 ROOM   601   ANG MO KIO AVE 5
...         ...         ...               ...   ...                ...
213878  2025-04      YISHUN         EXECUTIVE   828       YISHUN ST 81
213879  2025-05      YISHUN         EXECUTIVE   828       YISHUN ST 81
213880  2025-07      YISHUN         EXECUTIVE   824       YISHUN ST 81
213881  2025-05      YISHUN  MULTI-GENERATION   632       YISHUN ST 61
213882  2025-07      YISHUN  MULTI-GENERATION   633       YISHUN ST 61

       storey_range  floor_area_sqm        flat_model  lease_commence_date  \
0          10 TO 12            44.0          Improved                 1979
1          01 TO 03            67.0    New Generation                 1978
2          01 TO 03            67.0    New Generation                 1980
3          04 TO 06            68.0    New Generation                 1980
4          01 TO 03            67.0    New Generation                 1980
...             ...             ...               ...                  ...
213878     04 TO 06           146.0        Maisonette                 1988
213879     04 TO 06           142.0         Apartment                 1988
213880     04 TO 06           146.0        Maisonette                 1987
213881     04 TO 06           147.0  Multi Generation                 1987
213882     01 TO 03           171.0  Multi Generation                 1987

           remaining_lease  resale_price
0       61 years 04 months      232000.0
1       60 years 07 months      250000.0
2       62 years 05 months      262000.0
3        62 years 01 month      265000.0
4       62 years 05 months      265000.0
...                    ...           ...
213878  61 years 09 months      975000.0
213879  61 years 09 months     1000000.0
213880  61 years 05 months      980000.0
213881  61 years 06 months      945000.0
213882  61 years 06 months     1095000.0

[213579 rows x 11 columns]

In [45]:
#Categorized the month into year-to-year comparison
df['year'] = df['month'].str[:4].astype(int)
df.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,year
0,2017-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000.0,2017
1,2017-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000.0,2017
2,2017-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000.0,2017
3,2017-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000.0,2017
4,2017-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000.0,2017

In [47]:
#standardize the 'resale_price' into no decimal points
df['resale_price'] = df['resale_price'].astype(int)
print(df['resale_price'].head())
print(df['resale_price'].dtype)
df.head()

0    232000
1    250000
2    262000
3    265000
4    265000
Name: resale_price, dtype: int64
int64

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,year
0,2017-01,ANG MO KIO,2 ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000,2017
1,2017-01,ANG MO KIO,3 ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000,2017
2,2017-01,ANG MO KIO,3 ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000,2017
3,2017-01,ANG MO KIO,3 ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000,2017
4,2017-01,ANG MO KIO,3 ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000,2017

In [48]:
df['flat_type'] = df['flat_type'].str.replace(" ROOM", "-ROOM")
df.head()

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,year
0,2017-01,ANG MO KIO,2-ROOM,406,ANG MO KIO AVE 10,10 TO 12,44.0,Improved,1979,61 years 04 months,232000,2017
1,2017-01,ANG MO KIO,3-ROOM,108,ANG MO KIO AVE 4,01 TO 03,67.0,New Generation,1978,60 years 07 months,250000,2017
2,2017-01,ANG MO KIO,3-ROOM,602,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,262000,2017
3,2017-01,ANG MO KIO,3-ROOM,465,ANG MO KIO AVE 10,04 TO 06,68.0,New Generation,1980,62 years 01 month,265000,2017
4,2017-01,ANG MO KIO,3-ROOM,601,ANG MO KIO AVE 5,01 TO 03,67.0,New Generation,1980,62 years 05 months,265000,2017

In [54]:
df['floor_area_sqm'] = df['floor_area_sqm'].astype(int)
print(df['floor_area_sqm'].head())
df.head()

0    44
1    67
2    67
3    68
4    67
Name: floor_area_sqm, dtype: int64

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price,year
0,2017-01,ANG MO KIO,2-ROOM,406,ANG MO KIO AVE 10,10 TO 12,44,Improved,1979,61 years 04 months,232000,2017
1,2017-01,ANG MO KIO,3-ROOM,108,ANG MO KIO AVE 4,01 TO 03,67,New Generation,1978,60 years 07 months,250000,2017
2,2017-01,ANG MO KIO,3-ROOM,602,ANG MO KIO AVE 5,01 TO 03,67,New Generation,1980,62 years 05 months,262000,2017
3,2017-01,ANG MO KIO,3-ROOM,465,ANG MO KIO AVE 10,04 TO 06,68,New Generation,1980,62 years 01 month,265000,2017
4,2017-01,ANG MO KIO,3-ROOM,601,ANG MO KIO AVE 5,01 TO 03,67,New Generation,1980,62 years 05 months,265000,2017

In [ ]:
df.to